# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "lucaspickering/tap"
tap "tak-bro/aicommit2"

# ============================================
# Version Control
# ============================================
brew "git"
brew "git-lfs"
brew "git-flow-avh"
brew "git-filter-repo"
brew "gh"              # GitHub CLI
brew "jj"              # Jujutsu VCS

# ============================================
# Shell & Terminal
# ============================================
brew "zsh"
brew "zsh-completions"
brew "tmux"
brew "tmuxinator"

# ============================================
# Editors
# ============================================
brew "neovim"

# ============================================
# Modern CLI Tools
# ============================================
brew "fzf"             # Fuzzy finder
brew "ripgrep"         # Fast grep alternative
brew "fd"              # Fast find alternative
brew "bat"             # Cat with syntax highlighting
brew "eza"             # Modern ls replacement
brew "tldr"            # Simplified man pages
brew "thefuck"         # Correct previous command
brew "jq"              # JSON processor
brew "fx"              # JSON viewer
brew "navi"            # Interactive cheatsheet
brew "tree"            # Directory tree viewer
brew "tig"             # Git text interface
brew "wifi-password"   # Get WiFi password

# ============================================
# Development Tools
# ============================================
brew "node"
brew "yarn"
brew "pnpm"
brew "watchman"        # File watching service
brew "pre-commit"      # Git hook framework
brew "act"             # Run GitHub Actions locally
brew "scc"             # Code counter

# ============================================
# Version Managers
# ============================================
brew "jenv"            # Java version manager
brew "pyenv"           # Python version manager
brew "chruby"          # Ruby version manager
brew "ruby-install"

# ============================================
# HTTP & Network Tools
# ============================================
brew "wget"
brew "httpie"          # User-friendly HTTP client
brew "http-server"     # Simple HTTP server
brew "awscurl"         # AWS signed HTTP requests

# ============================================
# Container & DevOps
# ============================================
brew "docker", link: false

# ============================================
# Mobile Development
# ============================================
brew "cocoapods"       # iOS dependency manager
brew "ios-deploy"      # iOS app deployment
brew "fastlane"        # Mobile automation

# ============================================
# AI Tools
# ============================================
brew "aicommit2"       # AI commit message generator
brew "gemini-cli"      # Gemini CLI

# ============================================
# Java Development
# ============================================
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"

# ============================================
# Database
# ============================================
brew "postgresql@14", restart_service: :changed

# ============================================
# Other Tools
# ============================================
brew "asciinema"       # Terminal session recorder
brew "automake"
brew "bison"
brew "cryptography"
brew "gdbm"
brew "harfbuzz"
brew "libffi"
brew "libgit2@1.7"
brew "libyaml"
brew "openssl@3"
brew "rpm"
brew "lucaspickering/tap/slumber"

# ============================================
# GUI Applications
# ============================================

# Terminals
cask "warp"                    # Modern terminal
cask "iterm2"                  # Feature-rich terminal

# Productivity & Utilities
cask "alfred"                  # Launcher & productivity
cask "spectacle"               # Window management (or use Rectangle as free alternative)
cask "hiddenbar"               # Hide menu bar items
cask "maccy"                   # Clipboard manager
cask "cornercal"               # Calendar in menu bar
cask "karabiner-elements"      # Keyboard customization
cask "openinterminal-lite"     # Open terminal from Finder

# Browsers
# cask "arc"                   # Modern browser (install manually from website)
# cask "google-chrome"         # Chrome browser
# Note: Whale browser must be installed manually

# Communication
cask "slack"                   # Team communication
# cask "notion"                # Note-taking (install from App Store or website)
# cask "kakaotalk"             # Korean messenger (install from App Store)

# Development Tools
cask "visual-studio-code"      # Code editor
# cask "cursor"                # AI-powered code editor (install manually)
cask "docker-desktop"          # Docker GUI
cask "dbeaver-community"       # Database management
cask "postman"                 # API testing
cask "ngrok"                   # Tunneling service

# Design & Collaboration
# cask "figma"                 # Design tool (install manually or from website)
# cask "zeplin"                # Design handoff (install manually)

# IDEs
# cask "intellij-idea"         # Java/Kotlin IDE (install manually or via JetBrains Toolbox)
# cask "android-studio"        # Android development (install manually)

# AI Tools
# Note: Claude, ChatGPT, Ollama apps - install manually from respective websites

# Mobile Development
cask "android-platform-tools"

# Java Distributions
cask "temurin@21"
cask "zulu@17"

# Other
cask "wine-stable"
cask "gstreamer-runtime"

# ============================================
# Fonts
# ============================================
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# ============================================
# VS Code Extensions
# ============================================
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "vscodevim.vim"
